TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l130x.h
/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define DMA_SYS_N_DMA_CHANNEL                         (3)       /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (1)       /* !< Number of FULL-DMA channels implemented in DMA. */
#define CRC_SYS_CRC32_ENABLE                          (1)       /* !< Parameter to exclude or include 32-bit CRC. */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word. */
#define ADC_SYS_NUM_ANALOG_CHAN                       (16)      /* !< Number of analog channels. */
#define I2C_SYS_FENTRIES                              (8)       /* !< Number of FIFO entries */

/******************************************************************************
* DMA Triggers                                                                *
******************************************************************************/

/* External DMA Triggers */
#define DMA_SOFTWARE_TRIG                             (0)
#define DMA_GENERIC_SUB0_TRIG                         (1)
#define DMA_GENERIC_SUB1_TRIG                         (2)
#define DMA_ADC0_EVT_GEN_BD_TRIG                      (3)
#define DMA_I2C0_TX_TRIG                              (4)
#define DMA_I2C0_RX_TRIG                              (5)
#define DMA_I2C1_TX_TRIG                              (6)
#define DMA_I2C1_RX_TRIG                              (7)
#define DMA_SPI0_RX_TRIG                              (8)
#define DMA_SPI0_TX_TRIG                              (9)
#define DMA_UART0_RX_TRIG                             (10)
#define DMA_UART0_TX_TRIG                             (11)
#define DMA_UART1_RX_TRIG                             (12)
#define DMA_UART1_TX_TRIG                             (13)

/* Internal DMA Triggers */
#define DMA_CH_0_TRIG                                 (0)
#define DMA_CH_1_TRIG                                 (1)
#define DMA_CH_2_TRIG                                 (2)


/******************************************************************************
* IOMUX Pin Definitions                                                       *
******************************************************************************/

typedef enum IOMUX_PINCM
{
  IOMUX_PINCM1         = (0),
  IOMUX_PINCM2         = (1),
  IOMUX_PINCM3         = (2),
  IOMUX_PINCM4         = (3),
  IOMUX_PINCM5         = (4),
  IOMUX_PINCM6         = (5),
  IOMUX_PINCM7         = (6),
  IOMUX_PINCM8         = (7),
  IOMUX_PINCM9         = (8),
  IOMUX_PINCM10        = (9),
  IOMUX_PINCM11        = (10),
  IOMUX_PINCM12        = (11),
  IOMUX_PINCM13        = (12),
  IOMUX_PINCM14        = (13),
  IOMUX_PINCM15        = (14),
  IOMUX_PINCM16        = (15),
  IOMUX_PINCM17        = (16),
  IOMUX_PINCM18        = (17),
  IOMUX_PINCM19        = (18),
  IOMUX_PINCM20        = (19),
  IOMUX_PINCM21        = (20),
  IOMUX_PINCM22        = (21),
  IOMUX_PINCM23        = (22),
  IOMUX_PINCM24        = (23),
  IOMUX_PINCM25        = (24),
  IOMUX_PINCM26        = (25),
  IOMUX_PINCM27        = (26),
  IOMUX_PINCM28        = (27),
} IOMUX_PINCM;


/* IOMUX_PINCM1[PF] Bits */
#define IOMUX_PINCM1_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM1_PF_GPIOA_DIO00                   ((uint32_t)0X00000001)
#define IOMUX_PINCM1_PF_UART1_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_I2C0_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_TIMG1_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_SPI0_CS1_POCI1                ((uint32_t)0X00000005)
#define IOMUX_PINCM1_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)

/* IOMUX_PINCM2[PF] Bits */
#define IOMUX_PINCM2_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM2_PF_GPIOA_DIO01                   ((uint32_t)0X00000001)
#define IOMUX_PINCM2_PF_UART1_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM2_PF_I2C0_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_TIMG1_CCP1                    ((uint32_t)0X00000004)

/* IOMUX_PINCM3[PF] Bits */
#define IOMUX_PINCM3_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM3_PF_GPIOA_DIO02                   ((uint32_t)0X00000001)
#define IOMUX_PINCM3_PF_TIMG1_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_SPI0_CS0                      ((uint32_t)0X00000003)

/* IOMUX_PINCM4[PF] Bits */
#define IOMUX_PINCM4_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM4_PF_GPIOA_DIO03                   ((uint32_t)0X00000001)
#define IOMUX_PINCM4_PF_TIMG2_CCP0                    ((uint32_t)0X00000002)
#define IOMUX_PINCM4_PF_SPI0_CS1_POCI1                ((uint32_t)0X00000003)
#define IOMUX_PINCM4_PF_UART1_CTS                     ((uint32_t)0X00000004)
#define IOMUX_PINCM4_PF_COMP0_OUT                     ((uint32_t)0X00000005)
#define IOMUX_PINCM4_PF_I2C1_SDA                      ((uint32_t)0X00000006)

/* IOMUX_PINCM5[PF] Bits */
#define IOMUX_PINCM5_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM5_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM5_PF_TIMG2_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_SPI0_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM5_PF_UART1_RTS                     ((uint32_t)0X00000004)
#define IOMUX_PINCM5_PF_I2C1_SCL                      ((uint32_t)0X00000005)

/* IOMUX_PINCM6[PF] Bits */
#define IOMUX_PINCM6_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM6_PF_GPIOA_DIO05                   ((uint32_t)0X00000001)
#define IOMUX_PINCM6_PF_TIMG0_CCP0                    ((uint32_t)0X00000002)
#define IOMUX_PINCM6_PF_SPI0_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM6_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000004)

